// Напишите программу которая на вход принимаетчисто(N), а на выходе показывает все чËтные числа от 1 до (N).

Console.WriteLine("Введите число . ");
int num1 = Convert.ToInt32(Console.ReadLine());
